Documents/ПР_ДоговорОснащения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДоговорОснащения</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеАгентскогоДоговора</xr:Item>
				<xr:Item>Document.ПР_АППЗастройщик</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОснащения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПР_ТипыОснащения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОснащения</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПогашения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СФакторинговойКомпанией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СТранспортнойКомпанией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаемПолученный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПР_ДоговорОснащения/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура АгентскийДоговорПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента";
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.АгентскийДоговор);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Объект.Помещение = Справочники.АР_ОбъектыАренды.ПустаяСсылка();
	Иначе
		Объект.Помещение = Рез[0].ОбъектАренды;
	КонецЕсли;
	Объект.Организация = Объект.АгентскийДоговор.Организация;
	Объект.Контрагент = Объект.АгентскийДоговор.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура АгентскийДоговорПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.АгентскийДоговор) Тогда
		АгентскийДоговорПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикПогашения(Команда)   
	
	Если ЗначениеЗаполнено(Объект.Сумма) И ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		МесяцНачала = Месяц(Объект.ДатаНачала);
		МесяцКонца = Месяц(Объект.ДатаОкончания);
		ЛетМеждуДатами = Год(Объект.ДатаОкончания) - Год(Объект.ДатаНачала);
		КоличествоМесяцев = ЛетМеждуДатами * 12 - МесяцНачала + МесяцКонца + 1;  
		Месяц = 1; 
		ДатаГрафика = КонецМесяца(Объект.ДатаНачала);  
		СуммаРаспределено = 0;   
		Объект.ГрафикПогашения.Очистить();
		Пока Месяц <= КоличествоМесяцев Цикл
			Стр = Объект.ГрафикПогашения.Добавить();
			Стр.Дата = ДатаГрафика;
			Если Месяц = КоличествоМесяцев Тогда   
				Стр.Сумма = Объект.Сумма - СуммаРаспределено;	
			Иначе	
				Стр.Сумма = Объект.Сумма / КоличествоМесяцев; 
			КонецЕсли;
			СуммаРаспределено = СуммаРаспределено +	Стр.Сумма; 
			Месяц = Месяц + 1;
			ДатаГрафика = КонецМесяца(ДобавитьМесяц(ДатаГрафика,1));   
		КонецЦикла;   
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьДоговорБухНаСервере()
	Если ЗначениеЗаполнено(Объект.Номер) И ЗначениеЗаполнено(Объект.АгентскийДоговор) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |ГДЕ
		               |	ДоговорыКонтрагентов.Номер = &Номер
		               |	И ДоговорыКонтрагентов.Организация = &Организация
		               |	И ДоговорыКонтрагентов.Владелец = &Владелец
		               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
		Запрос.УстановитьПараметр("Номер", Объект.Номер);
		Запрос.УстановитьПараметр("Организация", Объект.АгентскийДоговор.Организация);
		Запрос.УстановитьПараметр("Владелец", Объект.АгентскийДоговор.Владелец);
		Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез[0].Ссылка = NULL Тогда
			Дог = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент(); 
			Дог.Дата = Объект.Дата;
			Дог.Номер = Объект.Номер;
			Дог.Организация = Объект.АгентскийДоговор.Организация;
			Дог.Владелец = Объект.АгентскийДоговор.Владелец;
			Дог.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку;  
		Иначе
			Объект.Договор = Рез[0].Ссылка;
		КонецЕсли;  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоговорБух(Команда)
	СоздатьДоговорБухНаСервере();
КонецПроцедуры
